app/views/devise/registrations/new.html.erb

SELECT "garins".* FROM "garins"
---
      <%= f.label :garin, class:"label" %>
      <%= f.association :garin, collection: Garin.all ,autofocus: true, class:"input", label: false %>