app/views/devise/registrations/new.html.erb

    <% if params[:g].present? %>
      <%= f.association :garin, collection: Garin.where(id: params[:g]), :label_method => :name, :value_method => :id, include_blank: false, wrapper_html: {class: "hidden"}  %>
---
SELECT "garins".* FROM "garins" WHERE "garins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]