app/views/garins/index.html.slim

        td
          = garin.budgets.pluck(:name)
---
SELECT "budgets"."name" FROM "budgets" WHERE "budgets"."garin_id" = $1  [["garin_id", 1]]