app/views/garins/show.html.erb

SELECT "time_periods".* FROM "time_periods" WHERE "time_periods"."garin_id" = $1 ORDER BY "time_periods"."id" DESC LIMIT $2  [["garin_id", 1], ["LIMIT", 1]]
SELECT "budgets".* FROM "budgets" WHERE "budgets"."garin_id" = $1  [["garin_id", 1]]
---
  <tbody>
    <% @garin.current_period.budgets.each do |budget| %>