app/views/garins/show.html.slim

  tbody
    - @garin.budgets.each do |budget|
---
SELECT "budgets".* FROM "budgets" WHERE "budgets"."garin_id" = $1  [["garin_id", 1]]