app/views/budgets/index.html.erb

        <td><%= budget.garin_id %></td>
        <td><%= budget.transactions.pluck(:description) %></td>
---
SELECT "transactions"."description" FROM "transactions" WHERE "transactions"."budget_id" = $1  [["budget_id", 1]]