app/views/budgets/show.html.slim

SELECT "transactions".* FROM "transactions" WHERE "transactions"."budget_id" = $1  [["budget_id", 1]]
---
	tbody
	  - @budget.transactions.each do |transaction|