app/controllers/budgets_controller.rb

INSERT INTO "budgets" ("name", "money", "garin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "123"], ["money", 4324], ["garin_id", 1], ["created_at", "2020-08-08 18:55:43.933759"], ["updated_at", "2020-08-08 18:55:43.933759"]]
---
  def create
    @budget = Budget.new(budget_params)
		@budget.current_money = @budget.money
		@budget.garin = current_user.garin
		@budget.time_period = @budget.garin.current_period
		respond_to do |format|
			if @budget.save

UPDATE "budgets" SET "money" = $1, "updated_at" = $2 WHERE "budgets"."id" = $3  [["money", 1000], ["updated_at", "2020-08-08 23:05:50.675116"], ["id", 12]]
---
  def update
		@budget.current_money = @budget.money
    respond_to do |format|
      if @budget.update(budget_params)

DELETE FROM "budgets" WHERE "budgets"."id" = $1  [["id", 27]]
---
  def destroy
    @budget.destroy

SELECT "budgets".* FROM "budgets" WHERE "budgets"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
---
    def set_budget
      @budget = Budget.find(params[:id])