app/controllers/garins_controller.rb

SELECT "garins".* FROM "garins"
---
  def index
    @garins = Garin.all

INSERT INTO "garins" ("name", "money", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "גרעין2"], ["money", 0], ["created_at", "2020-08-08 23:51:22.733391"], ["updated_at", "2020-08-08 23:51:22.733391"]]
---
  def create
    @garin = Garin.new(garin_params)

    respond_to do |format|
      if @garin.save

UPDATE "garins" SET "name" = $1, "updated_at" = $2 WHERE "garins"."id" = $3  [["name", "גרעין"], ["updated_at", "2020-08-08 17:14:04.245992"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @garin.update(garin_params)

SELECT "garins".* FROM "garins" WHERE "garins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_garin
      @garin = Garin.find(params[:id]) unless user_signed_in? && action_name == "show"