app/controllers/time_periods_controller.rb

  def index
    @time_periods = TimePeriod.all
---
SELECT "time_periods".* FROM "time_periods"

  def create
    @time_period = TimePeriod.new(time_period_params)
    @time_period.garin_id = params[:garin_id]
    if Garin.find(params[:garin_id]).time_periods.blank?
      @time_period.current_money = @time_period.money
    else
      @time_period.current_money = @time_period.money + TimePeriod.last.current_money
    end
    @time_period.money = @time_period.current_money
      if @time_period.save
---
SELECT "garins".* FROM "garins" WHERE "garins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "time_periods" ("date", "length", "garin_id", "current_money", "money", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["date", "2020-11-17"], ["length", 1], ["garin_id", 1], ["current_money", 1000], ["money", 1000], ["created_at", "2020-11-17 11:10:07.088615"], ["updated_at", "2020-11-17 11:10:07.088615"]]

    def set_time_period
      @time_period = TimePeriod.find(params[:id])
---
SELECT "time_periods".* FROM "time_periods" WHERE "time_periods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]