app/controllers/time_periods_controller.rb

    def set_time_period
      @time_period = TimePeriod.find(params[:id])
---
SELECT "time_periods".* FROM "time_periods" WHERE "time_periods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]