app/controllers/transactions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
		if params[:u]
			@transactions = User.find(params[:u]).transactions