app/controllers/transactions_controller.rb

  def new
    @transaction = Transaction.new
    @garin = Garin.find(params[:garin])
---
SELECT "garins".* FROM "garins" WHERE "garins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
		puts "****************** create **********************"
		@garin = Garin.find(params[:garin])
		@time_period = @garin.current_period
    @transaction = Transaction.new(transaction_params)
		@transaction.garin = @garin
    respond_to do |format|
      if @transaction.save!
				budget = @transaction.budget
				trans_money = @transaction.money
				budget.update(current_money: budget.current_money - trans_money)
				@time_period.update(current_money:  @time_period.current_money - trans_money )
---
SELECT "garins".* FROM "garins" WHERE "garins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "transactions" ("money", "budget_id", "created_at", "updated_at", "description", "garin_id", "date", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
UPDATE "budgets" SET "current_money" = $1, "updated_at" = $2 WHERE "budgets"."id" = $3  [["current_money", 1966], ["updated_at", "2020-11-17 12:08:42.305807"], ["id", 4]]
UPDATE "garins" SET "money" = $1, "updated_at" = $2 WHERE "garins"."id" = $3  [["money", 8364], ["updated_at", "2020-11-17 09:58:03.283625"], ["id", 1]]
UPDATE "time_periods" SET "current_money" = $1, "updated_at" = $2 WHERE "time_periods"."id" = $3  [["current_money", 966], ["updated_at", "2020-11-17 12:15:51.044968"], ["id", 1]]

  def update
    respond_to do |format|
      if @transaction.update(transaction_params)
---
UPDATE "transactions" SET "date" = $1, "updated_at" = $2 WHERE "transactions"."id" = $3  [["date", "2020-11-10"], ["updated_at", "2020-11-10 12:00:21.715936"], ["id", 3]]