app/models/ability.rb

SELECT "users"."id" FROM "users" WHERE "users"."garin_id" = $1  [["garin_id", 1]]
---
  def initialize(user)
    # Define abilities for the passed in user here. For example:
    #
      user ||= User.new # guest user (not logged in)
      if user.admin?
        can :manage, :all
      else
				if user.present?
					can :manage, Garin do |garin|
						garin.user_ids.include?(user.id)