app/models/garin.rb

SELECT "time_periods".* FROM "time_periods" WHERE "time_periods"."garin_id" = $1 ORDER BY "time_periods"."id" DESC LIMIT $2  [["garin_id", 1], ["LIMIT", 1]]
---
	def current_period
		self.time_periods.last